[IRI_PhaserRifle_BM X2WeaponTemplate]
FriendlyName="Compression Phaser Rifle"
FriendlyNamePlural="Compression Phaser Rifles"
BriefSummary="A vast improvement upon our Plasma Rifle, the Phaser Rifle features increased versatility thanks to multiple Power Settings."
TacticalText="A vast improvement upon our Plasma Rifle, the Phaser Rifle features increased versatility thanks to multiple Power Settings.<br/><bullet/> Kill Setting - standard firemode for dispatching enemies with lethal force.<br/><bullet/> Stun Setting - a shot performed at minimal power, stuns regular organic enemies, and disorients large enemies. Deals no environment damage.<br/><bullet/> Maximum Setting - a shot with vastly increased power output, deals more damage and can target enemies at squadsight ranges. On kill, disintegrates enemies. Doubles environment damage. Costs more Ammo, requires two Action Points."
AbilityDescName="phaser rifle"

[IRI_PhaserRifle_ScopedShot X2AbilityTemplate]
LocFriendlyName="Scoped Shot"
LocHelpText="Fire a long-range shot. <Ability:CANNOTBEDODGED/>"
LocLongDescription="<Bullet/>Firing the primary weapon always ends a unit's turn."

[IRI_PhaserRifle_Overwatch X2AbilityTemplate]
LocFriendlyName="Overwatch"
LocHelpText="Fire your current Power Setting on the first enemy that moves within your line of sight with a penalty to aim."
LocLongDescriptionWhenConcealed="Fire your current Power Setting on the first enemy that moves within your line of sight but only if revealed."
LocFlyOverText="Overwatch"
LocFriendlyNameWhenConcealed="Overwatch (Concealed)"

[IRI_PhaserRifle_OverwatchShot X2AbilityTemplate]
LocFriendlyName="Overwatch Shot"

[IRI_PhaserRifle_WideBeam X2AbilityTemplate]
LocFriendlyName="Fire Wide Beam"
LocHelpText="Discharge your current Power Setting at a target area."
LocLongDescription="Discharge your current Power Setting at a target area."
;"<Bullet/> Kill Setting - deal reduced damage to all targets in a cone, damaging their cover. 3 Ammo, 1 AP.<br/><bullet/> Stun Setting - apply stun setting to all targets in a cone. 2 Ammo, 1 AP.<br/><bullet/> Maximum Setting - deal high damage to all targets in a cone, destroying their cover and disintegrating their bodies on kill. 4 Ammo, 2 AP."

[IRI_CyclePhaserSettings X2AbilityTemplate]
LocFriendlyName="Cycle Settings"
LocLongDescription="Cycle through Power Settings."
LocHelpText="Cycle through Power Settings."

[IRI_PhaserRifle_DamagePassive X2AbilityTemplate]
LocFriendlyName="Power Setting"
LocLongDescription="Phaser Power Setting"
LocHelpText="Phaser Power Setting"

[IRI_PhaserRifle_Tech X2TechTemplate]
DisplayName="Compression Phaser Rifle"
Summary="While our prototype Plasma Rifle is a technological marvel, our field experience has shown that it can be too rigid and poorly suited for some of the tactical situations our away teams have to deal with. Modulating the plasma into a coherent phaser beam with different wavelengths would let the weapon switch between different \"power settings\", increasing its versatility."
LongDescription="The Compression Phaser Rifle will no doubt prove a major boon to our troops in the field thanks to much needed versatility improvements over the prototype Plasma Rifles. <br/><br/>C.O. Bradford has remarked that our away team members must be instructed to handle the weapon with care when using the Maximum Power Setting, particularly with the Wide Beam firemode, as it will be quite indiscriminate when choosing targets, inflicting horrible death upon them. R. Tygan."


;	This schematic uses Phaser Rifle localized description.
;[IRI_PhaserRifle_BM_Schematic X2SchematicTemplate]
;m_strClassLabel="SQUAD"

;[XComGame]
;[X2AbilityTemplateManager]
